soap/test/resources/tttRequestWithMyCode.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
	<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:S="http://www.w3.org/2003/05/soap-envelope"
			xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:xs="http://www.w3.org/2001/XMLSchema"
			xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
			xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			S:mustUnderstand="true">
			<wsu:Timestamp Id="_1">
				<wsu:Created>2013-01-31T20:28:41Z</wsu:Created>
				<wsu:Expires>2014-01-31T20:28:41Z</wsu:Expires>
			</wsu:Timestamp>
			<saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
				xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" ID="a956b920-4956-47c6-8a05-8a3a56e418a0"
				IssueInstant="2011-02-22T16:35:43.734Z" Version="2.0">
				<saml2:Issuer
					Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US
				</saml2:Issuer>
				<ds:Signature>
					<ds:SignedInfo>
						<ds:CanonicalizationMethod
							Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
						<ds:Reference URI="#a956b920-4956-47c6-8a05-8a3a56e418a0">
							<ds:Transforms>
								<ds:Transform
									Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
							<ds:DigestValue>JVSAi/1yiB6mmPFnGCOC89FJPsg=</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>X8d82A8S+btY79uPBelnJOsJ4M+LtFXY5tMbut0WBAxqeN8xQ0m/jv65oBmUtcXzf2t22BUD/7b3
						R5+rwnTppDD7zEUZXGPiN88oHh3FEgiPG3u/djftuZGw4p4F3hiALR53k9HSrmsNFn4nyVhIW1BR
						kaim3bcaRsfsR+8x7KhMSKqmzOSFVh4s26o+SsiqYDZFmbh1fYxjSsnMSRTwANcHFF/jAi4TM3Eh
						0bJ0CU+2byoj9q6D8gCPFSMdooPdYF8O5RXEk/oTZGJK9lzrHR5wFAHUbmfRVevOPFXmYRDZtkWL
						vYJG1cDO6Hr2z5FylDOHX/BMarMTUn36OusGXQ==
					</ds:SignatureValue>
					<ds:KeyInfo>
						<ds:KeyValue>
							<ds:RSAKeyValue>
								<ds:Modulus>lYGm36g0r4b/oqHbIfubfylKC1fIQUAT2w0IgnwPFqmpKvrvpz8JebHLVTsADxrX8j3C+FyUdC3n
									BFTihya8s9VmW3OfdX3e/XuQcpIqCA3uloUCVsNdEw8+H5fBuGdCYKVnZa38CvqZOajkMqHHt1MS
									/hZqEJKk1S0xKdLSy4ZiGlU/q7LMheWkJSQ0NSxsx9G5y9qAWKIH4G0HjwBU1Fu6FV+YcBCwCDqy
									PHL/aymm4RYB3zBTiXIBw7b1MeTYFFRmBF59ATklpAyXuxhBytIarwmZFzpZbnuiEB8ucJRJM72k
									xtBs26hHmM1CHCFXpxZ5PoG9DVWftBebsBLNew==
								</ds:Modulus>
								<ds:Exponent>AQAB</ds:Exponent>
							</ds:RSAKeyValue>
						</ds:KeyValue>
					</ds:KeyInfo>
				</ds:Signature>
				<saml2:Subject>
					<saml2:NameID
						Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">UID=Scenario 3 QDR-4.4a</saml2:NameID>
					<saml2:SubjectConfirmation
						Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
						<saml2:SubjectConfirmationData>
							<ds:KeyInfo>
								<ds:KeyValue>
									<ds:RSAKeyValue>
										<ds:Modulus>lYGm36g0r4b/oqHbIfubfylKC1fIQUAT2w0IgnwPFqmpKvrvpz8JebHLVTsADxrX8j3C+FyUdC3n
											BFTihya8s9VmW3OfdX3e/XuQcpIqCA3uloUCVsNdEw8+H5fBuGdCYKVnZa38CvqZOajkMqHHt1MS
											/hZqEJKk1S0xKdLSy4ZiGlU/q7LMheWkJSQ0NSxsx9G5y9qAWKIH4G0HjwBU1Fu6FV+YcBCwCDqy
											PHL/aymm4RYB3zBTiXIBw7b1MeTYFFRmBF59ATklpAyXuxhBytIarwmZFzpZbnuiEB8ucJRJM72k
											xtBs26hHmM1CHCFXpxZ5PoG9DVWftBebsBLNew==
										</ds:Modulus>
										<ds:Exponent>AQAB</ds:Exponent>
									</ds:RSAKeyValue>
								</ds:KeyValue>
							</ds:KeyInfo>
						</saml2:SubjectConfirmationData>
					</saml2:SubjectConfirmation>
				</saml2:Subject>
				<saml2:AuthnStatement AuthnInstant="2011-02-22T16:35:43.000Z"
					SessionIndex="123456">
					<saml2:SubjectLocality />
					<saml2:AuthnContext>
						<saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509
						</saml2:AuthnContextClassRef>
					</saml2:AuthnContext>
				</saml2:AuthnStatement>
				<saml2:AttributeStatement>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">Interop IT
							Testcase</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.3.717
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute
						Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.3.717
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:nhin:names:saml:homeCommunityId">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.3.717
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
						<saml2:AttributeValue>
							<hl7:Role xmlns:hl7="urn:hl7-org:v3"
								xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="46255001"
								codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED_CT"
								displayName="Pharmacist" xsi:type="hl7:CE" />
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
						<saml2:AttributeValue>
							<hl7:PurposeForUse xmlns:hl7="urn:hl7-org:v3"
								xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="TREATMENT"
								codeSystem="2.16.840.1.113883.3.18.7.1" codeSystemName="nhin-purpose"
								displayName="Treatment" xsi:type="hl7:CE" />
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute
						Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">RI2.102.00008^^^&amp;2.16.840.1.113883.3.717&amp;ISO
						</saml2:AttributeValue>
					</saml2:Attribute>
				</saml2:AttributeStatement>
				<saml2:AuthzDecisionStatement Decision="Permit"
					Resource="https://tnhin01.carespark.com:443/CONNECTGateway/NhinService/RespondingGateway_Query_Service/DocQuery">
					<saml2:Action Namespace="urn:oasis:names:tc:SAML:1.0:action:rwedc">Execute</saml2:Action>
					<saml2:Evidence>
						<saml2:Assertion ID="3e0d08ce-a126-45e8-b602-ac0c7ea075ce"
							IssueInstant="2011-02-22T16:35:43.000Z" Version="2.0">
							<saml2:Issuer
								Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US
							</saml2:Issuer>
							<saml2:Conditions NotBefore="2011-02-22T16:35:43.000Z"
								NotOnOrAfter="2011-02-22T16:35:43.000Z" />
							<saml2:AttributeStatement>
								<saml2:Attribute Name="AccessConsentPolicy"
									NameFormat="http://www.hhs.gov/healthit/nhin" />
								<saml2:Attribute Name="InstanceAccessConsentPolicy"
									NameFormat="http://www.hhs.gov/healthit/nhin" />
							</saml2:AttributeStatement>
						</saml2:Assertion>
					</saml2:Evidence>
				</saml2:AuthzDecisionStatement>
			</saml2:Assertion>
			<ds:Signature>
				<ds:SignedInfo>
					<ds:CanonicalizationMethod
						Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
					<ds:Reference URI="#_1">
						<ds:Transforms>
							<ds:Transform
								Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>YRYPazYm7XjmQgnK6Q7TDODKEOU=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>XHduS9ginkZFoezg0YSkyexGO6KnPSZXyjx8APiC7R5LKew+5MYU30HM8lnJHo/mk4m911lisJPp
					YlQykRllUk27/oS3eINSqwn7Z4wk7t6GsPz6sa3pv3bQI6mMlqJ3OZDBVHogVx7IX4MaEAow+j17
					MILoeQntQDS8j14axJ+7wxOfAxWH5FWb2L4nIi6RA5SFiky9clYJJJ4Dvo0hpDJ0Ikxazr7MmsJX
					WuaWWYeFXyGKJEWaIVWR7cU+WmPm8tzW4vpdGFdGCdeQmUcsgfFPBrC0FQiK0i5SA5NU7ao2OE40
					U0K2RN41QG28VK8DN30NjqVuMbk7h0BhnDzw/g==
				</ds:SignatureValue>
				<ds:KeyInfo>
					<wsse:SecurityTokenReference
						wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
						<wsse:KeyIdentifier
							ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">a956b920-4956-47c6-8a05-8a3a56e418a0
						</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
		<wsa:To soapenv:mustUnderstand="true">https://192.168.188.128:9892/Gateway/DocumentQuery/2_0/NhinService/RespondingGateway_Query_Service/DocQuery
		</wsa:To>
		<wsa:MessageID soapenv:mustUnderstand="true">urn:uuid:F3361F3EB4EFEFB1BA1359664121349
		</wsa:MessageID>
		<wsa:Action soapenv:mustUnderstand="true">urn:ihe:iti:2007:CrossGatewayQuery
		</wsa:Action>
	</soapenv:Header>
	<soapenv:Body>
		<query:AdhocQueryRequest
			xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
			xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<query:ResponseOption returnComposedObjects="true"
				returnType="ObjectRef" />
			<AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d"
				home="1.1">
				<Slot name="$XDSDocumentEntryPatientId">
					<ValueList>
						<Value>'DS3213'</Value>
					</ValueList>
				</Slot>
				<Slot name="$XDSDocumentEntryStatus">
					<ValueList>
						<Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved',
							'urn:oasis:names:tc:ebxml-regrep:StatusType:Deprecated')</Value>
					</ValueList>
				</Slot>
			</AdhocQuery>
		</query:AdhocQueryRequest>
	</soapenv:Body>
</soapenv:Envelope>