samples/ITI-43_request_raw.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
 xmlns:wsa="http://www.w3.org/2005/08/addressing"
 xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
 xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
 xmlns:xsdb="urn:ihe:iti:xds-b:2007"
 xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion">
 <soapenv:Header>
  <wsa:To soapenv:mustUnderstand="1">https://epd-test.com:6443/Repository/services/RepositoryService</wsa:To>
  <wsa:MessageID soapenv:mustUnderstand="1">urn:uuid:1EB10F67-6562-46D5-9B6B-5DC42EB2B4A6</wsa:MessageID>
  <wsa:Action soapenv:mustUnderstand="1">urn:ihe:iti:2007:RetrieveDocumentSet</wsa:Action>
  <wsse:Security>
   <saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xsd="http://www.w3.org/2001/XMLSchema" ID="_5316abb1-becd-4b5e-bcd0-591f4978247a" IssueInstant="2020-09-22T12:13:35.264Z" Version="2.0">
    <saml2:Issuer>http://epd-test.com/eHealthSolutionsSTS</saml2:Issuer>
    <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
     <ds:SignedInfo>
      <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
      <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
      <ds:Reference URI="#_5316abb1-becd-4b5e-bcd0-591f4978247a">
       <ds:Transforms>
        <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
        <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
         <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd"/>
        </ds:Transform>
       </ds:Transforms>
       <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
       <ds:DigestValue>3KoarNU8GPZsm9UcB91vU8Ak2qlsoLMe1PykjiIwp1s=</ds:DigestValue>
      </ds:Reference>
     </ds:SignedInfo>
     <ds:SignatureValue>b17Gu/R3...omitted for brevity...bQoUgUUEdA==</ds:SignatureValue>
     <ds:KeyInfo>
      <ds:X509Data>
       <ds:X509Certificate>MIID5...omitted for brevity...iHysp</ds:X509Certificate>
      </ds:X509Data>
     </ds:KeyInfo>
    </ds:Signature>
    <saml2:Subject>
     <saml2:NameID Format="urn:oasis:names:tc:SAML:2.0:nameid-format:persistent" NameQualifier="urn:gs1:gln">9801003538489</saml2:NameID>
     <saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer">
      <saml2:SubjectConfirmationData InResponseTo="Assertion_b945ce9fbd9e81d4fc27d6239d7c642ebdc146c0" NotOnOrAfter="2020-09-22T12:28:35.264Z" Recipient="https://epdtest.arts.local:8549/ACS"/>
     </saml2:SubjectConfirmation>
    </saml2:Subject>
    <saml2:Conditions NotBefore="2020-09-22T12:13:34.264Z" NotOnOrAfter="2020-09-22T12:28:35.264Z">
     <saml2:AudienceRestriction>
      <saml2:Audience>urn:e-health-suisse:token-audience:all-communities</saml2:Audience>
     </saml2:AudienceRestriction>
    </saml2:Conditions>
    <saml2:AuthnStatement AuthnInstant="2020-09-22T12:13:35.264Z">
     <saml2:AuthnContext>
      <saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport</saml2:AuthnContextClassRef>
     </saml2:AuthnContext>
    </saml2:AuthnStatement>
    <saml2:AttributeStatement>
     <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization">
      <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:string">Health CH AG</saml2:AttributeValue>
     </saml2:Attribute>
     <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id">
      <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:anyURI">urn:oid:1.3.6.1.4.1.21367.2017.2.6.19.100.2</saml2:AttributeValue>
     </saml2:Attribute>
     <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id">
      <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:string">Sarah Stone</saml2:AttributeValue>
     </saml2:Attribute>
     <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
      <saml2:AttributeValue>
       <Role xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="HCP" codeSystem="2.16.756.5.30.1.127.3.10.6" codeSystemName="eHealth Suisse EPR Actors" displayName="Healthcare professional" xsi:type="CE"/>
      </saml2:AttributeValue>
     </saml2:Attribute>
     <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
      <saml2:AttributeValue>
       <hl7:PurposeOfUse xmlns:hl7="urn:hl7-org:v3" code="EMER" codeSystem="2.16.756.5.30.1.127.3.10.5" codeSystemName="eHealth Suisse Verwendungszweck" displayName="Notfallzugriff"/>
      </saml2:AttributeValue>
     </saml2:Attribute>
     <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id">
      <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:token">761337610410098484^^^SPID&amp;2.16.756.5.30.1.127.3.10.3&amp;ISO</saml2:AttributeValue>
     </saml2:Attribute>
     <saml2:Attribute Name="urn:ihe:iti:xca:2010:homeCommunityId" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
      <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:anyURI">urn:oid:1.3.6.1.4.1.21367.2017.2.6.19</saml2:AttributeValue>
     </saml2:Attribute>
    </saml2:AttributeStatement>
   </saml2:Assertion>
  </wsse:Security>
 </soapenv:Header>
 <soapenv:Body>
  <xsdb:RetrieveDocumentSetRequest>
   <xsdb:DocumentRequest>
    <xsdb:HomeCommunityId>urn:oid:1.3.6.1.4.1.21367.2017.2.6.19</xsdb:HomeCommunityId>
    <xsdb:RepositoryUniqueId>1.3.6.1.4.1.21367.2017.2.3.54</xsdb:RepositoryUniqueId>
    <xsdb:DocumentUniqueId>1.3.6.1.4.1.21367.2017.2.1.75.20200922130227623</xsdb:DocumentUniqueId>
   </xsdb:DocumentRequest>
  </xsdb:RetrieveDocumentSetRequest>
 </soapenv:Body>
</soapenv:Envelope>
